tutorials/OF300_400/pistonTank/constant/multiPistonMovementDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      multiPistonMovementDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

genAbs          0;

tSmooth         0.1;
tuningFactor    1.;

timeSeries
3002
...

paddlePosition
10(
...
...
...
...
...
...
...
...
...
...
);
